api/app/controllers/concerns/team_scoped.rb

  def team_from_subdomain
    subdomain = request.subdomain
    return nil if subdomain.blank?

    # SEGURANÇA: Validar se o usuário tem acesso ao team do subdomain
    requested_team = Team.find_by(subdomain: subdomain)
    return nil unless requested_team

    # Permitir apenas se for o team do usuário atual
    if @current_user.present? && @current_user.respond_to?(:team) && (requested_team == @current_user.team)
---
SELECT "teams".* FROM "teams" WHERE "teams"."deleted_at" IS NULL AND "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]