app/services/team_subdomain_generator.rb

SELECT 1 AS one FROM "teams" WHERE "teams"."deleted_at" IS NULL AND "teams"."subdomain" = $1 LIMIT $2  [["subdomain", "adv5898"], ["LIMIT", 1]]
SELECT 1 AS one FROM "teams" WHERE "teams"."deleted_at" IS NULL AND "teams"."subdomain" = $1 LIMIT $2  [["subdomain", "u21"], ["LIMIT", 1]]
---
  def ensure_unique_subdomain(base_subdomain)
    return base_subdomain unless Team.exists?(subdomain: base_subdomain)

    # Se já existe, adiciona número até encontrar um único
    counter = 1
    loop do
      candidate = "#{base_subdomain}#{counter}"
      return candidate unless Team.exists?(subdomain: candidate)