api/app/models/represent.rb

  def set_defaults
    self.start_date ||= Date.current
    self.team_id ||= profile_customer&.customer&.teams&.first&.id
---
SELECT "teams".* FROM "teams" INNER JOIN "team_customers" ON "teams"."id" = "team_customers"."team_id" WHERE "teams"."deleted_at" IS NULL AND "team_customers"."deleted_at" IS NULL AND "team_customers"."customer_id" = $1 ORDER BY "teams"."id" ASC LIMIT $2  [["customer_id", 3], ["LIMIT", 1]]