api/app/controllers/api/v1/customer/profile_customers_controller.rb

UPDATE "profile_customers" SET "name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "profile_customers"."id" = $4  [["name", "Jhones"], ["last_name", "Silva"], ["updated_at", "2025-08-23 18:48:37.687724"], ["id", 2]]
---
  def update
    authorize @profile_customer, :update?, policy_class: Customer::ProfileCustomerPolicy

    if params[:save_as_draft] == 'true'
      save_draft_if_requested
      render json: {
        message: 'Draft saved successfully',
        draft_id: @profile_customer.drafts.last&.id
      }, status: :ok
    elsif @profile_customer.update(profile_customers_params)