app/controllers/users_controller.rb

SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."deleted_at" IS NULL AND "user_profiles"."user_id" IN ($1, $2)  [["user_id", 7], ["user_id", 10]]
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."team_id" = $1  [["team_id", 9]]
SELECT "teams".* FROM "teams" WHERE "teams"."deleted_at" IS NULL AND "teams"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def index
    @users = current_user.team.users.includes(:user_profile)

INSERT INTO "user_profiles" ("role", "name", "last_name", "gender", "oab", "rg", "cpf", "nationality", "civil_status", "birth", "mother_name", "status", "user_id", "created_at", "updated_at", "office_id", "origin", "deleted_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "jwt_token", "deleted_at", "status", "oab", "team_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @user_profile = UserProfile.new(user_profile_params)
    @user_profile.user.team = current_user.team if @user_profile.user

    if @user_profile.save

SELECT "teams".* FROM "teams" WHERE "teams"."deleted_at" IS NULL AND "teams"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."team_id" = $1 AND "users"."id" = $2 LIMIT $3  [["team_id", 9], ["id", 7], ["LIMIT", 1]]
---
  def set_user
    @user = current_user.team.users.find(params[:id])