api/app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "adv5898@gmail.com"], ["LIMIT", 1]]
---
      def authenticate_with_email_and_password
        user = User.find_for_authentication(email: auth_params[:email])

SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def build_auth_response(token, user_profile)
        response = { token: token }

        # Pega o user do token decodificado
        user_id = decode_jwt_token(token)['user_id'] || decode_jwt_token(token)['admin_id']
        user = User.find(user_id)