api/app/controllers/api/v1/customers_controller.rb

SELECT "customers".* FROM "customers" INNER JOIN "team_customers" ON "customers"."id" = "team_customers"."customer_id" WHERE "customers"."deleted_at" IS NULL AND "team_customers"."deleted_at" IS NULL AND "team_customers"."team_id" = $1  [["team_id", 5]]
SELECT COUNT(*) FROM "customers" INNER JOIN "team_customers" ON "customers"."id" = "team_customers"."customer_id" WHERE "customers"."deleted_at" IS NULL AND "team_customers"."deleted_at" IS NULL AND "team_customers"."team_id" = $1  [["team_id", 5]]
---
      def index
        customers = current_team.customers.includes(
          profile_customer: [
            :customer, :emails, :phones, :addresses, :bank_accounts,
            :customer_files, :represented_customers, :active_represents
          ]
        )

        filter_by_deleted_params.each do |key, value|
          next if value.blank?

          customers = customers.public_send("filter_by_#{key}", value.strip)
        end

        serialized = CustomerSerializer.new(
          customers,
          include: [:profile_customer],
          meta: {
            total_count: customers.offset(nil).limit(nil).count
          }
        ).serializable_hash