api/app/controllers/api/v1/user_profiles_controller.rb

INSERT INTO "user_profiles" ("role", "name", "last_name", "gender", "oab", "rg", "cpf", "nationality", "civil_status", "birth", "mother_name", "status", "user_id", "created_at", "updated_at", "office_id", "origin", "deleted_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."deleted_at" IS NULL AND "user_profiles"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
      def create
        # Handle avatar separately if present
        avatar_file = params.dig(:user_profile, :avatar)
        profile_params = user_profiles_params.except(:avatar)

        # If user_attributes are present but user_id is not, we're creating a new user
        if profile_params[:user_attributes].present? && !profile_params[:user_id]
          user_attrs = profile_params[:user_attributes]
          user_attrs[:team_id] = current_team.id
          user_attrs[:access_email] ||= user_attrs[:email]

          # Build the user first
          user = User.new(user_attrs)
          profile_params.delete(:user_attributes)

          # Build the profile with the user
          user_profile = user.build_user_profile(profile_params)
        else
          user_profile = UserProfile.new(profile_params)

          # If creating a new user through nested attributes, set the team
          if user_profile.user&.new_record?
            user_profile.user.team_id = current_team.id
            user_profile.user.access_email = user_profile.user.email
          end
        end

        if user_profile.save
          # Handle avatar upload if provided
          if avatar_file.present?

SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."deleted_at" IS NULL AND "user_profiles"."user_id" = $1 LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
---
      def update
        # Handle avatar upload separately if present
        avatar_file = params.dig(:user_profile, :avatar)
        profile_params = user_profiles_params.except(:avatar)

        # Update profile attributes
        if @user_profile.update(profile_params)
          # Handle avatar upload if provided
          if avatar_file.present?

SELECT "user_phones".* FROM "user_phones" WHERE "user_phones"."deleted_at" IS NULL AND "user_phones"."user_profile_id" = $1 ORDER BY "user_phones"."id" ASC LIMIT $2  [["user_profile_id", 1], ["LIMIT", 1]]
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."deleted_at" IS NULL AND "user_profiles"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
      def complete_profile
        # Autorizar explicitamente para este método
        authorize :user_profile, :complete?

        user = @current_user
        user_profile = user.user_profile

        # Se não existe user_profile, criar um novo
        user_profile = user.build_user_profile if user_profile.nil?

        ActiveRecord::Base.transaction do # rubocop:disable Metrics/BlockLength
          # Atualizar dados básicos do profile
          basic_params = profile_completion_params.except(:phone, :addresses_attributes, :phones_attributes)
          user_profile.update!(basic_params) if basic_params.present?

INSERT INTO "user_addresses" ("address_id", "user_profile_id", "created_at", "updated_at", "deleted_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address_id", 1], ["user_profile_id", 1], ["created_at", "2025-08-26 10:49:29.318259"], ["updated_at", "2025-08-26 10:49:29.318259"], ["deleted_at", nil]]
INSERT INTO "user_profiles" ("role", "name", "last_name", "gender", "oab", "rg", "cpf", "nationality", "civil_status", "birth", "mother_name", "status", "user_id", "created_at", "updated_at", "office_id", "origin", "deleted_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
---
          addresses_attrs = params.dig(:user_profile, :addresses_attributes)
          if addresses_attrs.present?
            addresses_attrs.each do |address_attr|
              user_profile.addresses.create!(
                street: address_attr[:street],
                number: address_attr[:number],
                neighborhood: address_attr[:neighborhood],
                city: address_attr[:city],
                state: address_attr[:state],
                zip_code: address_attr[:zip_code],
                complement: address_attr[:description],
                address_type: 'main'
              )