api/app/controllers/api/v1/user_profiles_controller.rb

      def create_or_update_phone(user_profile, phone_number)
        # Limpa o telefone (remove formatação)
        clean_phone = phone_number.gsub(/\D/, '')

        # Verifica se já existe um telefone (usando polymorphic association)
        existing_phone = user_profile.phones.first

        if existing_phone
          # Atualiza o telefone existente
          existing_phone.update!(phone_number: clean_phone)
        else
          # Cria novo telefone diretamente pela associação polimórfica
          user_profile.phones.create!(
            phone_number: clean_phone
          )
---
SELECT "user_phones".* FROM "user_phones" WHERE "user_phones"."deleted_at" IS NULL AND "user_phones"."user_profile_id" = $1 ORDER BY "user_phones"."id" ASC LIMIT $2  [["user_profile_id", 1], ["LIMIT", 1]]
INSERT INTO "user_phones" ("phone_id", "user_profile_id", "created_at", "updated_at", "deleted_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["phone_id", 1], ["user_profile_id", 1], ["created_at", "2025-08-26 10:49:29.286814"], ["updated_at", "2025-08-26 10:49:29.286814"], ["deleted_at", nil]]