api/app/controllers/api/v1/works_controller.rb

SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."deleted_at" IS NULL AND "user_profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
      def index
        works = team_scoped(Work).includes(
          :profile_customers,
          :user_profiles,
          :law_area,
          :powers,
          :recommendations,
          :jobs,
          :documents,
          :pending_documents
        ).all