app/controllers/concerns/jwt_auth.rb

  def authenticate_user
    # Support both new user_id and legacy admin_id for backward compatibility
    user_id = payload['user_id'] || payload['admin_id']
    head :unauthorized and return unless user_id

    @current_user ||= User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]