api/app/controllers/api/v1/public/user_registration_controller.rb

INSERT INTO "teams" ("name", "subdomain", "settings", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "jwt_token", "deleted_at", "status", "oab", "team_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
        def create
          ActiveRecord::Base.transaction do
            # Primeiro criar o team
            team = create_team_for_user

            # Depois criar o user associado ao team
            user = User.new(user_params.merge(team: team))

            # Usar save! para garantir rollback automático se falhar
            user.save!

INSERT INTO "teams" ("name", "subdomain", "settings", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
        def create_team_for_user
          # Buscar dados do advogado se OAB foi fornecida
          lawyer_name = nil
          if params.dig(:user, :oab).present?
            lawyer_data = fetch_lawyer_data_from_oab(params[:user][:oab])
            lawyer_name = build_full_name(lawyer_data) if lawyer_data
          end

          # Gerar subdomain baseado no nome do advogado ou email
          subdomain = TeamSubdomainGenerator.generate(
            name: lawyer_name,
            email: params.dig(:user, :email)
          )

          # Gerar nome do team
          team_name = generate_team_name(lawyer_name, params.dig(:user, :email))

          Team.create!(
            name: team_name,
            subdomain: subdomain,
            settings: { auto_created: true }
          )

SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."deleted_at" IS NULL AND "user_profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
        def build_response_data(user)
          # Response simples para registro - lógica de completeness vai para o login
          data = {
            id: user.id,
            email: user.email,
            oab: user.oab,
            team: {
              id: user.team.id,
              name: user.team.name,
              subdomain: user.team.subdomain
            }
          }

          # Informar se UserProfile foi criado com dados da OAB
          if user.user_profile.present?